// створити 3 обʼєкти через {}
// створити 3 обʼєкти через Object()
// створити обʼєкт на базі протиту іншого обʼєку (Object.create(інший_оʼєкт), або через __prototype__), створити одному в кожному форматі
// створити обʼєкт engineer, від нього унаслідувати QA_engineer, вивести деталі по всім полям (engineer, QA_engineer)
// унаслідувати ваш існуючий engineer від person. вивести значення всіх 3х обʼєктів
// - https://leetcode.com/problems/merge-sorted-array/

// створити 3 обʼєкти через {}

objOne = {}
//2
//3

// створити 3 обʼєкти через Object()


// створити обʼєкт на базі протиту іншого обʼєку (Object.create(інший_оʼєкт), або через __prototype__), створити одному в кожному форматі


// створити обʼєкт engineer, від нього унаслідувати QA_engineer, вивести деталі по всім полям (engineer, QA_engineer)


// унаслідувати ваш існуючий engineer від person. вивести значення всіх 3х обʼєктів


// - https://leetcode.com/problems/merge-sorted-array/









